tests/fixtures/response-vertrokken-onbekend-waarheen.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <BG:stuurgegevens>
                <StUF:berichtcode>La01</StUF:berichtcode>
                <StUF:zender>
                    <StUF:organisatie>Amsterdam</StUF:organisatie>
                    <StUF:applicatie>applicationName</StUF:applicatie>
                </StUF:zender>
                <StUF:ontvanger>
                    <StUF:applicatie>applicationName</StUF:applicatie>
                    <StUF:gebruiker>userName</StUF:gebruiker>
                </StUF:ontvanger>
                <StUF:referentienummer>MK3</StUF:referentienummer>
                <StUF:tijdstipBericht>2019102110220970</StUF:tijdstipBericht>
                <StUF:crossRefnummer>MijnAmsterdam</StUF:crossRefnummer>
                <StUF:entiteittype>NPS</StUF:entiteittype>
            </BG:stuurgegevens>
            <BG:parameters>
                <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            </BG:parameters>
            <BG:antwoord>
                <BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="10042310661829" StUF:sleutelGegevensbeheer="10042310661829">
                    <BG:inp.bsn>123456789</BG:inp.bsn>
                    <BG:inp.a-nummer>1111111</BG:inp.a-nummer>
                    <BG:geslachtsnaam>Vertrokken</BG:geslachtsnaam>
                    <BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:voorletters>O.W.</BG:voorletters>
                    <BG:voornamen>Onbekend Waarheen</BG:voornamen>
                    <BG:aanduidingNaamgebruik>E</BG:aanduidingNaamgebruik>
                    <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
                    <BG:geboortedatum>19540101</BG:geboortedatum>
                    <BG:inp.geboorteplaats>0363</BG:inp.geboorteplaats>
                    <BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
                    <BG:overlijdensdatum xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.overlijdenplaats xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.overlijdenLand xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.verblijftIn StUF:entiteittype="NPSTGO" StUF:sleutelVerzendend="10042310661832"
                                        StUF:sleutelGegevensbeheer="10042310661832">
                        <BG:gerelateerde StUF:entiteittype="TGO" StUF:sleutelVerzendend="10042310511422"
                                         StUF:sleutelGegevensbeheer="10042310511422">
                            <BG:adresAanduidingGrp>
                                <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                                <BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="geenWaarde"/>
                                <BG:aoa.postcode xsi:nil="true" StUF:noValue="geenWaarde"/>
                                <BG:aoa.huisnummer xsi:nil="true" StUF:noValue="geenWaarde"/>
                                <BG:aoa.huisletter xsi:nil="true" StUF:noValue="geenWaarde"/>
                                <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="geenWaarde"/>
                                <BG:ogo.locatieAanduiding xsi:nil="true" StUF:noValue="geenWaarde"/>
                            </BG:adresAanduidingGrp>
                            <BG:brt.buurtCode xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            <BG:gem.gemeenteCode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                            <BG:wyk.wijkCode xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            <StUF:extraElementen>
                                <StUF:extraElement naam="identificatieNummerAanduiding" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                                <StUF:extraElement naam="officieleStraatnaam" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                            </StUF:extraElementen>
                        </BG:gerelateerde>
                        <StUF:tijdvakRelatie>
                            <StUF:beginRelatie>20190101</StUF:beginRelatie>
                            <StUF:eindRelatie xsi:nil="true" StUF:noValue="geenWaarde"/>
                        </StUF:tijdvakRelatie>
                    </BG:inp.verblijftIn>
                    <BG:verblijfsadres>
                        <BG:aoa.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.straatnaam xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.postcode xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisnummer xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisletter xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:begindatumVerblijf>20190101</BG:begindatumVerblijf>
                    </BG:verblijfsadres>
                    <BG:sub.correspondentieAdres>
                        <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <BG:postcode xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:gor.straatnaam xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisnummer xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisletter xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="geenWaarde"/>
                    </BG:sub.correspondentieAdres>
                    <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:acd.code xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
                    <BG:inp.gemeenteVanInschrijving>1999</BG:inp.gemeenteVanInschrijving>
                    <BG:inp.datumInschrijving>20190101</BG:inp.datumInschrijving>
                    <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.datumVerkrijgingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.datumVerliesVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumVertrekUitNederland>20190101</BG:inp.datumVertrekUitNederland>
                    <BG:inp.emigratieLand>0</BG:inp.emigratieLand>
                    <BG:inp.aanduidingBijzonderNederlanderschap xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.indicatieCurateleRegister xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumOpschortingBijhouding>20190101</BG:inp.datumOpschortingBijhouding>
                    <BG:inp.redenOpschortingBijhouding>E</BG:inp.redenOpschortingBijhouding>
                    <BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
                    <StUF:extraElementen>
                        <StUF:extraElement naam="CBR-nummer" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="aanduidingBijzonderNederlanderschapOmschrijving" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoek" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoekOverlijden" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoekVerblijfstitel" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingNaamgebruikOmschrijving">Eigen geslachtsnaam</StUF:extraElement>
                        <StUF:extraElement naam="adellijkeTitelsoort" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="bic" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="codeGeboorteplaats">0363</StUF:extraElement>
                        <StUF:extraElement naam="codePlaatsoverlijden" xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <StUF:extraElement naam="einddatumUitsluitingKiesrecht" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="geboortelandnaam">Nederland</StUF:extraElement>
                        <StUF:extraElement naam="geboorteplaatsnaam">Amsterdam</StUF:extraElement>
                        <StUF:extraElement naam="gemeentenaamInschrijving">RNI</StUF:extraElement>
                        <StUF:extraElement naam="handlichting" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="iban" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="indicatieOuderOntzetUitOuderlijkeMacht" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="landnaamEmigratie">Onbekend</StUF:extraElement>
                        <StUF:extraElement naam="landnaamImmigratie" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="landnaamOverlijden" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingAcademischeTitel" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="omschrijvingAdellijkeTitel" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingBurgerlijkeStaat">Ongehuwd</StUF:extraElement>
                        <StUF:extraElement naam="omschrijvingGeslachtsaanduiding">Man</StUF:extraElement>
                        <StUF:extraElement naam="omschrijvingIndicatieCurateleregister" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingIndicatieGeheim">Geen beperking</StUF:extraElement>
                        <StUF:extraElement naam="omschrijvingIndicatieGezagMinderjarige" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingIndicatieOuderOntzet" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingOnderToezichtstelling" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="omschrijvingPlaatsOverlijden" xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <StUF:extraElement naam="omschrijvingRedenOpschortingBijhoudingOmschrijving">Emigratie</StUF:extraElement>
                        <StUF:extraElement naam="omschrijvingUitsluitingKiesrecht" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingVerblijfstitel" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="onderToezichtstelling" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="opgemaakteNaam">V.O Waarheen</StUF:extraElement>
                        <StUF:extraElement naam="rechtsvorm" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="terAttentieVan" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="uitsluitingKiesrecht" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </StUF:extraElementen>
                    <BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsKinderen StUF:entiteittype="NPSNPSKND" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" StUF:sleutelVerzendend="10042310661833" StUF:sleutelGegevensbeheer="10042310661833">
                        <BG:gerelateerde StUF:entiteittype="NAT">
                            <BG:code>1</BG:code>
                            <BG:omschrijving>Nederlandse</BG:omschrijving>
                        </BG:gerelateerde>
                        <BG:inp.datumVerkrijging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:inp.datumVerlies xsi:nil="true" StUF:noValue="geenWaarde"/>
                        <StUF:tijdvakRelatie>
                            <StUF:beginRelatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                            <StUF:eindRelatie xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        </StUF:tijdvakRelatie>
                        <StUF:extraElementen>
                            <StUF:extraElement naam="aanduidingGegevensInOnderzoek">N</StUF:extraElement>
                        </StUF:extraElementen>
                    </BG:inp.heeftAlsNationaliteit>
                    <BG:ing.isHouderVan StUF:entiteittype="NPSRSDHDR" xsi:nil="true" StUF:noValue="geenWaarde"/>
                </BG:object>
            </BG:antwoord>
        </BG:npsLa01>
    </soapenv:Body>
</soapenv:Envelope>
